import { Infos } from '../shared/types'

export const infosAbout: Infos = [
   {
      name: 'Профессиональные навыки:',
      lis: [
         'Умение разбираться в чужом коде;',
         'Исключительно адаптивная и кроссбраузерная верстка;',
         'Понимание базовых принципов разработки пользовательского интерфейса: создание приложений без участия UI дизайнера и готового макета в Figma;',
         'Отличное представление сетевого взаимодействия между SPA и бекендом, умение работать с web-сервисами (Web API, REST, JSON);',
         'Знание принципов работы бандлеров и пакетных менеджеров, есть опыт сборки pet-проектов на WebPack с использованием и настройкой Prettier, ESLint, Husky, Lint-Staged;',
         'Готовность расширять кругозор технологий и узнавать новое.',
      ],
   },
   {
      name: 'Гибкие навыки:',
      lis: [
         'Способность анализировать информацию и делать обоснованные выводы;',
         'Умение эффективно управлять своим временем и приоритетами;',
         'Способность понимать и уважать чувства и взгляды других;',
         'Аналитический склад ума, умение мыслить логически и абстрактно;',
         'Навык объяснять сложные технические концепции простыми словами;',
      ],
   },
]
