import { Services } from '../shared/types'

export const services: Services = [
   {
      name: 'Fronted-разработчик',
      text: 'Создаю визуально красивые интерфейсы веб-приложений, отвечающие за удобство взаимодействия пользователя.',
      icon: 'bx bx-code-alt',
   },
   {
      name: 'SEO',
      text: 'Обладаю набором стратегий и техник для улучшения видимости и ранжирования сайта в результатах поисковых систем.',
      icon: 'bx bx-signal-5',
   },
   {
      name: 'Редактирование видео',
      text: 'Обработка и компоновка видеоматериала, монтаж, добавление эффектов, коррекция цвета.',
      icon: 'bx bx-slideshow',
   },
   {
      name: 'Обработка фото',
      text: 'Улучшаю изображения с помощью корректировки цвета, освещения, резкости и удаления дефектов.',
      icon: 'bx bx-camera',
   },
]
