import { Skills } from '../shared/types'

export const skills: Skills = [
   {
      name: 'Fronted-разработчик',
      company: 'Oscar (Муза)',
      text: [
         'повысил производительность frontend-приложений на 35% за счёт оптимизации рендеринга, мемоизации и кеширования',
         'сократил время загрузки (LCP, FCP) на 40% благодаря lazy-loading, code splitting иоптимизации критического CSS',
         'ускорил разработку фич на 30% за счёт проектирования и внедрения UI-kit',
         'реализовал WordPress-темы и шаблоны с ACF, сократив время работы контент-команды на 40%',
      ],
   },
   {
      name: 'Fronted-разработчик',
      company: 'Searchinform',
      text: [
         'cнизил количество frontend-багов на 50% за счёт рефакторинга JavaScript-кода',
         'повысил производительность клиентской части на 40% благодаря оптимизации',
      ],
   },
]
